ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/ICSSM_ICSSM_PR1_PDSP1_IRAM_48024000h.xml
<module name="ICSSM_PR1_PDSP1_IRAM" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="ICSSM_PR1_PDSP1_IRAM_CONTROL" acronym="ICSSM_PR1_PDSP1_IRAM_CONTROL" offset="0" width="32" description="">
		<bitfield id="PCOUNTER_RST_VAL" width="16" begin="31" end="16" resetval="0x0" description="Program counter reset value" range="31:16" rwaccess="R/W"/>
	<bitfield id="PDSP_STATE" width="1" begin="15" end="15" resetval="0x0" description="PDSP run state: 0=PDSP is halted, 1=PDSP is running" range="15" rwaccess="R"/>
	<bitfield id="BIG_ENDIAN" width="1" begin="14" end="14" resetval="0x0" description="Big-endian input state" range="14" rwaccess="R"/>
	<bitfield id="SINGLE_STEP" width="1" begin="8" end="8" resetval="0x0" description="Single step enable: 0=PDSP will free run when enabled, 1=PDSP will execute a single instruction and then the pdsp_enable bit will be cleared" range="8" rwaccess="R/W"/>
	<bitfield id="RESTART" width="1" begin="4" end="4" resetval="0x0" description="Causes PDSP to stop current operation gracefully and return to the PC reset value" range="4" rwaccess="R/W"/>
	<bitfield id="COUNTER_ENABLE" width="1" begin="3" end="3" resetval="0x0" description="PDSP cycle counter enable: 0=Counters not enabled, 1=Counters enabled" range="3" rwaccess="R/W"/>
	<bitfield id="PDSP_SLEEPING" width="1" begin="2" end="2" resetval="0x0" description="PDSP sleep indicator: 0=PDSP is not asleep, 1=PDSP us asleep" range="2" rwaccess="R/W"/>
	<bitfield id="PDSP_ENABLE" width="1" begin="1" end="1" resetval="0x0" description="PDSP enable: 0=PDSP is disabled, 1=PDSP is enabled" range="1" rwaccess="R/W"/>
	<bitfield id="SOFT_RST_N" width="1" begin="0" end="0" resetval="0x1" description="Soft reset. When this bit is cleared, the PDSP will be reset. This bit is set back to 1 on the next cycle after it has been cleared." range="0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_PDSP1_IRAM_STATUS" acronym="ICSSM_PR1_PDSP1_IRAM_STATUS" offset="4" width="32" description="">
		<bitfield id="PCOUNTER" width="16" begin="15" end="0" resetval="0x0" description="Current PDSP program counter" range="15:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_PDSP1_IRAM_WAKEUP_ENABLE" acronym="ICSSM_PR1_PDSP1_IRAM_WAKEUP_ENABLE" offset="8" width="32" description="">
		<bitfield id="BITWISE_ENABLES" width="32" begin="31" end="0" resetval="0x0" description="Wakeup enables" range="31:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_PDSP1_IRAM_CYCLE_COUNT" acronym="ICSSM_PR1_PDSP1_IRAM_CYCLE_COUNT" offset="12" width="32" description="">
		<bitfield id="CYCLECOUNT" width="32" begin="31" end="0" resetval="0x0" description="This value is incremented by 1 for every clock cycle during which the PDSP is enabled and the counter is enabled." range="31:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_PDSP1_IRAM_STALL_COUNT" acronym="ICSSM_PR1_PDSP1_IRAM_STALL_COUNT" offset="16" width="32" description="">
		<bitfield id="STALLCOUNT" width="32" begin="31" end="0" resetval="0x0" description="This value is incremented by 1 for every clock cycle during which the PDSP is enabled, the counter is enabled, and the PDSP was unable to fetch a new instruction for any reason." range="31:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_PDSP1_IRAM_CONSTANT_TABLE_BLOCK_INDEX_0" acronym="ICSSM_PR1_PDSP1_IRAM_CONSTANT_TABLE_BLOCK_INDEX_0" offset="32" width="32" description="">
		<bitfield id="C25_BLK_INDEX" width="8" begin="23" end="16" resetval="0x0" description="PDSP constant entry 25 block index" range="23:16" rwaccess="R/W"/>
	<bitfield id="C24_BLK_INDEX" width="8" begin="7" end="0" resetval="0x0" description="PDSP constant entry 24 block index" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_PDSP1_IRAM_CONSTANT_TABLE_BLOCK_INDEX_1" acronym="ICSSM_PR1_PDSP1_IRAM_CONSTANT_TABLE_BLOCK_INDEX_1" offset="36" width="32" description="">
		<bitfield id="C27_BLK_INDEX" width="8" begin="23" end="16" resetval="0x0" description="PDSP constant entry 27 block index" range="23:16" rwaccess="R/W"/>
	<bitfield id="C26_BLK_INDEX" width="8" begin="7" end="0" resetval="0x0" description="PDSP constant entry 26 block index" range="7:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_PDSP1_IRAM_CONSTANT_TABLE_PROG_PTR_0" acronym="ICSSM_PR1_PDSP1_IRAM_CONSTANT_TABLE_PROG_PTR_0" offset="40" width="32" description="">
		<bitfield id="C29_POINTER" width="16" begin="31" end="16" resetval="0x0" description="PDSP constant entry 29 pointer" range="31:16" rwaccess="R/W"/>
	<bitfield id="C28_POINTER" width="16" begin="15" end="0" resetval="0x0" description="PDSP constant entry 28 pointer" range="15:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_PDSP1_IRAM_CONSTANT_TABLE_PROG_PTR_1" acronym="ICSSM_PR1_PDSP1_IRAM_CONSTANT_TABLE_PROG_PTR_1" offset="44" width="32" description="">
		<bitfield id="C31_POINTER" width="16" begin="31" end="16" resetval="0x0" description="PDSP constant entry 31 pointer" range="31:16" rwaccess="R/W"/>
	<bitfield id="C30_POINTER" width="16" begin="15" end="0" resetval="0x0" description="PDSP constant entry 30 pointer" range="15:0" rwaccess="R/W"/>
	</register>
</module>